// Привет! Это встраиваемый онлайн-редактор кода DartPad.

// Это какой-то код на языке Dart. Нажмите Run, чтобы запустить его.
int func() {
  for (i = 0; i < 5; i++) {
    print('hello ${i + 1}');
  }
}

// В коде ошибки и их нужно исправить!
// Компилятор подскажет, какие ошибки компиляции он встретил в коде.

// Если задание подразумевает автоматическую проверку вашего решения,
// и ваш код компилируется, вы увидите либо сообщение об ошибке
// при тестировании, либо сообщение "All tests passed".

// Если вы чувствуете, что вам нужна подсказка,
// нажмите Hint рядом с кнопкой Run.

// Если вы уверены что хотите увидеть вариант решения задания,
// выберите вкладку кода Solution наверху.
