// Эта функция должна возвращать корни
// квадратного уравнения ax^2 + bx + c = 0
// с точностью до 6 знака после запятой.
// Если корень один, она должна возвращать
// два одинаковых числа.
// Если корней нет, она должна возвращать (null, null).
// Гарантируется, что a != 0.

// Напишите недостающий код и ответьте для себя на вопросы:
// 1. Какой тип данных возвращает функция?
// 2. Что нужно исправить в уже имеющемся коде
//    функции, чтобы она работала корректно?
// 3. Нужно ли подключать библиотеки?
(double, double) solve(
  double a,
  double b,
  double c,
) {
  // ...
}