// Это вариант решения задачи -- работающий код!
void func() {
  for (int i = 0; i < 5; i++) {
    print('hello ${i + 1}');
  }
}

// Вы всегда можете посмотреть solution для задания,
// и никто об этом не узнает!
// Но всегда лучше сначала постараться решить задание самостоятельно.

// То, что в solution указан именно этот код, не значит,
// что это единственно верное решение. Например,
// функцию func можно оставить с возвращаемым значением int,
// просто вернуть какое-то числовое значение в конце.
// А переменную i можно также объявить до цикла for.